{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm1_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm1_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm1", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "relu1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm2_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm2_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm2", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0], [14, 0, 1], [15, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU1", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ConvolutionDepthwise1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvolutionDepthwise1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "96", 
        "num_group": "96", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm3_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm3_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm3", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU2", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm4_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm4_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm4", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0], [30, 0, 1], [31, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "Convolution3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm5_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm5_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm5", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU3", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ConvolutionDepthwise2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvolutionDepthwise2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm6_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm6_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm6_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm6_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm6", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU4", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution4_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution4", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm7_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm7_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm7_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm7_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm7", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "fuse3", 
      "inputs": [[32, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution5_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution5", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm8_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm8_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm8_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm8_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm8", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU5", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ConvolutionDepthwise3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvolutionDepthwise3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm9_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm9_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm9_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm9_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm9", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU6", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution6_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution6", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm10_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm10_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm10_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm10_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm10", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 1], [78, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "Convolution7_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution7", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm11_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm11_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm11_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm11_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm11", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU7", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ConvolutionDepthwise4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvolutionDepthwise4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm12_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm12_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm12_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm12_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm12", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0], [92, 0, 1], [93, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU8", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution8_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution8", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm13_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm13_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm13_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm13_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm13", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "fuse5", 
      "inputs": [[79, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution9_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution9", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm14_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm14_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm14_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm14_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm14", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU9", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ConvolutionDepthwise5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvolutionDepthwise5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm15_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm15_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm15_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm15_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm15", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0], [116, 0, 1], [117, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU10", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution10_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution10", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm16_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm16_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm16_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm16_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm16", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 1], [125, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "Convolution11_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution11", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm17_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm17_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm17_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm17_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm17", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 1], [132, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU11", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ConvolutionDepthwise6_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "ConvolutionDepthwise6", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "192", 
        "num_group": "192", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm18_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm18_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm18_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm18_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm18", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0], [139, 0, 1], [140, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "ReLU12", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Convolution12_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Convolution12", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "BatchNorm19_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm19_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm19_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "BatchNorm19_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "BatchNorm19", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "False", 
        "use_global_stats": "True"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "fuse7", 
      "inputs": [[126, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fc1_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "200"
      }, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "fc2_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.01"
      }, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "50"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "50"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "136"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "136"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "136"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    12, 
    13, 
    14, 
    15, 
    18, 
    20, 
    21, 
    22, 
    23, 
    26, 
    28, 
    29, 
    30, 
    31, 
    33, 
    35, 
    36, 
    37, 
    38, 
    41, 
    43, 
    44, 
    45, 
    46, 
    49, 
    51, 
    52, 
    53, 
    54, 
    57, 
    59, 
    60, 
    61, 
    62, 
    65, 
    67, 
    68, 
    69, 
    70, 
    73, 
    75, 
    76, 
    77, 
    78, 
    80, 
    82, 
    83, 
    84, 
    85, 
    88, 
    90, 
    91, 
    92, 
    93, 
    96, 
    98, 
    99, 
    100, 
    101, 
    104, 
    106, 
    107, 
    108, 
    109, 
    112, 
    114, 
    115, 
    116, 
    117, 
    120, 
    122, 
    123, 
    124, 
    125, 
    127, 
    129, 
    130, 
    131, 
    132, 
    135, 
    137, 
    138, 
    139, 
    140, 
    143, 
    145, 
    146, 
    147, 
    148, 
    151, 
    152, 
    155, 
    156, 
    159, 
    160, 
    162, 
    163
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    202, 
    203
  ], 
  "heads": [[164, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10501]}
}